app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if DAO.save_user(@user)
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login") VALUES('2009-12-14 10:05:54', 'c11d5db073ea458d009de321558a639ec92866522fc4c36d65f3881162ed380388716fc70a3598ef2c3ebdc5ea5cf9b431d2866a53287e02586daaea1314a810', '2009-12-14 10:05:54', 'cvGQpLRc0D6jeobBN4L_', 'f76c16991c85bfc40c006a417064e74c0b51ddc4bbee94dd2e44b738c653cb7035abb1212bcd004df273a947f222bd6979a31b7765949ec38a7dd36346572d56', 'flo')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    attributes = params[:user]
    if DAO.update_user(@user, attributes)
---
UPDATE "users" SET "persistence_token" = '05e9f9849196a2320d7c960dc2af71da8e599f0dfd1468ce7d3cdd295dd62c56873248050074dc64051f1472ed0987058a0fe2a834b62334ff015d687bb76525', "updated_at" = '2009-12-14 10:10:31', "password_salt" = 'c9bVnn9yjQdPs54oCM9L', "crypted_password" = '1d1717abcf87ede2f821c662d04ed6678c8afc8dd7b8c7d18c17f9c0d85ab4e48102c70833a2272fd6af886f911194810271393123b7d216fdcff22d20e84f66' WHERE "id" = 1